const yaoText = {
    '111111': {
        name: '乾',
        yaoCi: [
            '初九，潛龍勿用。',
            '九二，見龍在田，利見大人。',
            '九三，君子終日乾乾，夕惕若厲，無咎。',
            '九四，或躍在淵，無咎。',
            '九五，飛龍在天，利見大人。',
            '上九，亢龍有悔。'
        ]
    },
    '000000': {
        name: '坤',
        yaoCi: [
            '初六，履霜，堅冰至。',
            '六二，直方大，不習無不利。',
            '六三，含章可貞，或從王事，無成有終。',
            '六四，括囊，無咎無譽。',
            '六五，黃裳，元吉。',
            '上六，龍戰于野，其血玄黃。'
        ]
    },
    '010001': {
        name: '屯',
        yaoCi: [
            '初九，磐桓；利居貞，利建侯。',
            '六二，屯如邅如，乘馬班如。匪寇婚媾，女子貞不字，十年乃字。',
            '六三，即鹿無虞，惟入于林中；君子幾不如舍，往吝。',
            '六四，乘馬班如，求婚媾，往吉，無不利。',
            '九五，屯其膏，小貞吉，大貞凶。',
            '上六，乘馬班如，泣血漣如。'
        ]
    },
    '100010': {
        name: '蒙',
        yaoCi: [
            '初六，發蒙，利用刑人，用說桎梏，以往吝。',
            '九二，包蒙吉；納婦吉；子克家。',
            '六三，勿用取女；見金夫，不有躬，無攸利。',
            '六四，困蒙，吝。',
            '六五，童蒙，吉。',
            '上九，擊蒙；不利為寇，利禦寇。'
        ]
    },
    '010111': {
        name: '需',
        yaoCi: [
            '初九，需于郊，利用恆，無咎。',
            '九二，需于沙，小有言，終吉。',
            '九三，需于泥，致寇至。',
            '六四，需于血，出自穴。',
            '九五，需于酒食，貞吉。',
            '上六，入于穴，有不速之客三人來，敬之終吉。'
        ]
    },
    '111010': {
        name: '訟',
        yaoCi: [
            '初六，不永所事，小有言，終吉。',
            '九二，不克訟，歸而逋，其邑人三百戶，無眚。',
            '六三，食舊德，貞厲，終吉。或從王事，無成。',
            '九四，不克訟，復即命渝，安貞吉。',
            '九五，訟元吉。',
            '上九，或錫之鞶帶，終朝三褫之。'
        ]
    },
    '000010': {
        name: '師',
        yaoCi: [
            '初六，師出以律，否臧凶。',
            '九二，在師中，吉無咎，王三錫命。',
            '六三，師或輿尸，凶。',
            '六四，師左次，無咎。',
            '六五，田有禽，利執言，無咎。長子帥師，弟子輿尸，貞凶。',
            '上六，大君有命，開國承家，小人勿用。'
        ]
    },
    '010000': {
        name: '比',
        yaoCi: [
            '初六，有孚比之，無咎。有孚盈缶，終來有他，吉。',
            '六二，比之自內，貞吉。',
            '六三，比之匪人。',
            '六四，外比之，貞吉。',
            '九五，顯比，王用三驅，失前禽，邑人不誡，吉。',
            '上六，比之無首，凶。'
        ]
    },
    '110111': {
        name: '小畜',
        yaoCi: [
            '初九，復自道，何其咎？吉。',
            '九二，牽復，吉。',
            '九三，輿說輻，夫妻反目。',
            '六四，有孚，血去惕出，無咎。',
            '九五，有孚攣如，富以其鄰。',
            '上九，既雨既處，尚德載；婦貞厲，月幾望，君子征凶。'
        ]
    },
    '111011': {
        name: '履',
        yaoCi: [
            '初九，素履，往無咎。',
            '九二，履道坦坦，幽人貞吉。',
            '六三，眇能視，跛能履，履虎尾，咥人，凶；武人為于大君。',
            '九四，履虎尾，愬愬終吉。',
            '九五，夬履，貞厲。',
            '上九，視履考祥，其旋元吉。'
        ]
    },
    '000111': {
        name: '泰',
        yaoCi: [
            '初九，拔茅茹，以其彙；征吉。',
            '九二，包荒，用馮河，不遐遺；朋亡，得尚于中行。',
            '九三，無平不陂，無往不復。艱貞無咎，勿恤其孚，于食有福。',
            '六四，翩翩不富，以其鄰，不戒以孚。',
            '六五，帝乙歸妹，以祉元吉。',
            '上六，城復于隍；勿用師，自邑告命，貞吝。'
        ]
    },
    '111000': {
        name: '否',
        yaoCi: [
            '初六，拔茅茹，以其彙，貞吉亨。',
            '六二，包承。小人吉，大人否亨。',
            '六三，包羞。',
            '九四，有命無咎，疇離祉。',
            '九五，休否，大人吉。其亡其亡，繫于苞桑。',
            '上九，傾否，先否後喜。'
        ]
    },
    '111101': {
        name: '同人',
        yaoCi: [
            '初九，同人于野，亨。利涉大川，利君子貞。',
            '六二，同人于宗，吝。',
            '九三，伏戎于莽，升其高陵，三歲不興。',
            '九四，乘其墉，弗克攻，吉。',
            '九五，同人先號咷，而後笑。大師克相遇。',
            '上九，同人于郊，無悔。'
        ]
    },
    '101111': {
        name: '大有',
        yaoCi: [
            '初九，無交害，匪咎。艱則無咎。',
            '九二，大車以載，有攸往，無咎。',
            '九三，公用亨于天子，小人弗克。',
            '九四，匪其彭，無咎。',
            '六五，厥孚交如，威如；吉。',
            '上九，自天祐之，吉無不利。'
        ]
    },
    '000100': {
        name: '謙',
        yaoCi: [
            '初六，謙謙君子，用涉大川，吉。',
            '六二，鳴謙，貞吉。',
            '九三，勞謙，君子有終，吉。',
            '六四，無不利，撝謙。',
            '六五，不富以其鄰，利用侵伐，無不利。',
            '上六，鳴謙，利用行師，征邑國。'
        ]
    },
    '001000': {
        name: '豫',
        yaoCi: [
            '初六，鳴豫，凶。',
            '六二，介于石，不終日，貞吉。',
            '六三，盱豫，悔，遲有悔。',
            '九四，由豫，大有得；勿疑，朋盍簪。',
            '六五，貞疾，恆不死。',
            '上六，冥豫，成有渝，無咎。'
        ]
    },
    '011001': {
        name: '隨',
        yaoCi: [
            '初九，官有渝，貞吉。出門交有功。',
            '六二，繫小子，失丈夫。',
            '六三，繫丈夫，失小子。隨有求得。利居貞。',
            '九四，隨有獲，貞凶。有孚在道，以明，何咎？',
            '九五，孚于嘉，吉。',
            '上六，拘繫之，乃從維之。王用亨于西山。'
        ]
    },
    '100110': {
        name: '蠱',
        yaoCi: [
            '初六，幹父之蠱，有子考無咎，厲終吉。',
            '九二，幹母之蠱，不可貞。',
            '九三，幹父之蠱，小有悔，無大咎。',
            '六四，裕父之蠱，往見吝。',
            '六五，幹父之蠱，用譽。',
            '上九，不事王侯，高尚其事。'
        ]
    },
   '000011': {
        name: '臨',
        yaoCi: [
            '初九，咸臨，貞吉。',
            '九二，咸臨，吉，無不利。',
            '六三，甘臨，無攸利。既憂之，無咎。',
            '六四，至臨，無咎。',
            '六五，知臨，大君之宜，吉。',
            '上六，敦臨，吉，無咎。'
        ]
    },
    '110000': {
        name: '觀',
        yaoCi: [
            '初六，童觀，小人無咎，君子吝。',
            '六二，闚觀，利女貞。',
            '六三，觀我生，進退。',
            '六四，觀國之光，利用賓于王。',
            '九五，觀我生，君子無咎。',
            '上九，觀其生，君子無咎。'
        ]
    },
    '101001': {
        name: '噬嗑',
        yaoCi: [
            '初九，屨校滅趾，無咎。',
            '六二，噬膚滅鼻，無咎。',
            '六三，噬腊肉，遇毒；小吝，無咎。',
            '九四，噬乾胏，得金矢；利艱貞，吉。',
            '六五，噬乾肉，得黃金；貞厲，無咎。',
            '上九，何校滅耳，凶。'
        ]
    },
    '100101': {
        name: '賁',
        yaoCi: [
            '初九，賁其趾，舍車而徒。',
            '六二，賁其須。',
            '九三，賁如濡如，永貞吉。',
            '六四，賁如皤如，白馬翰如，匪寇婚媾。',
            '六五，賁于丘園，束帛戔戔，吝，終吉。',
            '上九，白賁，無咎。'
        ]
    },
    '100001': {
        name: '剝',
        yaoCi: [
            '初六，剝床以足，蔑貞凶。',
            '六二，剝床以辨，蔑貞凶。',
            '六三，剝之，無咎。',
            '六四，剝床以膚，凶。',
            '六五，貫魚，以宮人寵，無不利。',
            '上九，碩果不食，君子得輿，小人剝廬。'
        ]
    },
    '000001': {
        name: '復',
        yaoCi: [
            '初九，不遠復，無祇悔，元吉。',
            '六二，休復，吉。',
            '六三，頻復，厲無咎。',
            '六四，中行獨復。',
            '六五，敦復，無悔。',
            '上六，迷復，凶，有災眚。用師行，終有大敗；以其國君，凶；至于十年，不克征。'
        ]
    },
    '111001': {
        name: '無妄',
        yaoCi: [
            '初九，無妄，往吉。',
            '六二，不耕穫，不菑畬，則利有攸往。',
            '六三，無妄之災；或繫之牛，行人之得，邑人之災。',
            '九四，可貞，無咎。',
            '九五，無妄之疾，勿藥有喜。',
            '上九，無妄之行，無眚；利艱貞。'
        ]
    },
    '100111': {
        name: '大畜',
        yaoCi: [
            '初九，有厲，利已。',
            '九二，輿說輹。',
            '九三，良馬逐，利艱貞。日閒輿衛，利有攸往。',
            '六四，童豕之牿，元吉。',
            '六五，豶豕之牙，吉。',
            '上九，何天之衢，亨。'
        ]
    },
    '100001': {
        name: '頤',
        yaoCi: [
            '初九，舍爾靈龜，觀我朵頤，凶。',
            '六二，顛頤，拂經于丘頤，征凶。',
            '六三，拂頤，貞凶。十年勿用，無攸利。',
            '六四，顛頤，吉。虎視眈眈，其欲逐逐，無咎。',
            '六五，拂經，居貞吉，不可涉大川。',
            '上九，由頤，厲吉，利涉大川。'
        ]
    },
    '011110': {
        name: '大過',
        yaoCi: [
            '初六，藉用白茅，無咎。',
            '九二，枯楊生稊，老夫得其女妻，無不利。',
            '九三，棟橈，凶。',
            '九四，棟隆，吉；有它吝。',
            '九五，枯楊生華，老婦得其士夫，無咎無譽。',
            '上六，過涉滅頂，凶，無咎。'
        ]
    },
    '010010': {
        name: '坎',
        yaoCi: [
            '初六，習坎，入于坎窞，凶。',
            '九二，坎有險，求小得。',
            '六三，來之坎坎，險且枕，入于坎窞，勿用。',
            '六四，樽酒簋貳，用缶；納約自牖，終無咎。',
            '九五，坎不盈，祇既平，無咎。',
            '上六，繫用徽纆，寘于叢棘，三歲不得。'
        ]
    },
