const yaoText = {
    "000000": {
        "name": "地  坤",
        "yaoCi": [
            "上六：龍戰於野，其血玄黃。",
            "六五：黃裳，元吉。",
            "六四：括囊，無咎，無譽。",
            "六三：含章可貞，或從王事，無成有終。",
            "六二：直方大，不習無不利。",
            "初六：履霜，堅冰至。"
        ]
    },
    "000001": {
        "name": "地雷  復",
        "yaoCi": [
            "上六：有眚，無咎。",
            "六五：敦復，無悔。",
            "六四：中行獨復。",
            "六三：頻復，厲，無咎。",
            "六二：休復，吉。",
            "初九：不遠復，無祗悔，元吉。"
        ]
    },
    "000010": {
        "name": "地水  師",
        "yaoCi": [
            "上六：大君有命，開國承家，小人勿用。",
            "六五：田有禽，利執言，無咎。長子帥師，弟子輿尸，貞凶。",
            "六四：師左次，無咎。",
            "六三：師或輿尸，凶。",
            "九二：在師中，吉，無咎，王三錫命。",
            "初六：師出以律，否臧凶。"
        ]
    },
    "000011": {
        "name": "地澤  臨",
        "yaoCi": [
            "上六：敦臨，吉無咎。",
            "六五：知臨，大君之宜，吉。",
            "六四：至臨，無咎。",
            "六三：甘臨，無攸利。既憂之，無咎。",
            "九二：咸臨，吉，無不利。",
            "初九：咸臨，貞吉。"
        ]
    },
    "010111": {
        "name": "水天  需",
        "yaoCi": [
            "上六：入於穴，有不速之客三人來，敬之終吉。",
            "九五：需於酒食，貞吉。",
            "六四：需於血，出自穴。",
            "九三：需於泥，致寇至。",
            "九二：需於沙，小有言，終吉。",
            "初九：需於郊，利用恆，無咎。"
        ]
    },
    "000100": {
        "name": "地山  謙",
        "yaoCi": [
            "上六：鳴謙，利用行師，征邑國。",
            "六五：不富以其鄰，利用侵伐，無不利。",
            "六四：無不利，撝謙。",
            "九三：勞謙君子，有終吉。",
            "六二：鳴謙，貞吉。",
            "初六：謙謙君子，用涉大川，吉。"
        ]
    },
    "000101": {
        "name": "地火  明夷",
        "yaoCi": [
            "上六：初登於天，後入於地。",
            "六五：箕子之明夷，利貞。",
            "六四：入於左腹，獲明夷之心，於出門庭。",
            "九三：明夷於南狩，得其大首，不可疾貞。",
            "六二：明夷夷於左股，用拯馬壯吉。",
            "初九：明夷於飛，垂其翼。君子於行，三日不食。有攸往，主人有言。"
        ]
    },
    "000110": {
        "name": "地風  升",
        "yaoCi": [
            "上六：冥升利於不息之貞。",
            "六五：貞吉升階。",
            "六四：王用亨於岐山吉無咎。",
            "九三：升虛邑。",
            "九二：孚乃利用禴，無咎。",
            "初六：允升大吉。"
        ]
    },
    "000111": {
        "name": "地天  泰",
        "yaoCi": [
            "上六：城復於隍，勿用師。自邑告命，貞吝。",
            "六五：帝乙歸妹，以祉元吉。",
            "六四：翩翩不富，以其鄰，不戒以孚。",
            "九三：無平不陂，無往不復。艱貞無咎。勿恤其孚，於食有福。",
            "九二：包荒，用馮河，不遐遺。朋亡，得尚於中行。",
            "初九：拔茅茹，以其彙。征吉。"
        ]
    },
    "001000": {
        "name": "雷地  豫",
        "yaoCi": [
            "上六：冥豫，成有渝，無咎。",
            "六五：貞疾，恆不死。",
            "九四：由豫，大有得。勿疑，朋盍簪。",
            "六三：盱豫，悔。遲有悔。",
            "六二：介於石，不終日，貞吉。",
            "初六：鳴豫，凶。"
        ]
    },
    "001001": {
        "name": "雷  震",
        "yaoCi": [
            "上六：震索索，視矍矍，征凶。震不於其躬於其鄰，無咎。婚媾有言。",
            "六五：震往來厲，億無喪有事。",
            "九四：震遂泥。",
            "六三：震蘇蘇，震行無眚。",
            "六二：震來厲，億喪貝，躋於九陵，勿逐七日得。",
            "初九：震來虩虩，後笑言啞啞，吉。"
        ]
    },
    "001010": {
        "name": "雷水  解",
        "yaoCi": [
            "上六：公用射隼於高墉之上，獲之無不利。",
            "六五：君子維有解，吉，有孚於小人。",
            "九四：解而拇，朋至斯孚。",
            "六三：負且乘，致寇至，貞吝。",
            "九二：田獲三狐，得黃矢，貞吉。",
            "初六：無咎。"
        ]
    },
    "001011": {
        "name": "雷澤  歸妹",
        "yaoCi": [
            "上六：女承筐無實，士刲羊無血，無攸利。",
            "六五：帝乙歸妹，其君之袂不如其娣之袂良。月幾望吉。",
            "九四：歸妹愆期，遲歸有時。",
            "六三：歸妹以須，反歸以娣。",
            "九二：眇能視，利幽人之貞。",
            "初九：歸妹以娣，跛能履，征吉。"
        ]
    },
    "001100": {
        "name": "雷山  小過",
        "yaoCi": [
            "上六：弗遇，過之，飛鳥離之，凶，是謂災眚。",
            "六五：密雲不雨，自我西郊，公弋取彼在穴。",
            "九四：無咎，弗過遇之。往厲必戒，勿用永貞。",
            "九三：弗過，防之，從或戕之，凶。",
            "六二：過其祖，遇其妣，不及其君，遇其臣，無咎。",
            "初六：飛鳥以凶。"
        ]
    },
    "001101": {
        "name": "雷火  豐",
        "yaoCi": [
            "上六：豐其屋，蔀其家，闚其戶，闃其無人，三歲不覿，凶。",
            "六五：來章有慶譽吉。",
            "九四：豐其蔀，日中見斗，遇其夷主，吉。",
            "九三：豐其沛，日中見沬。折其右肱，無咎。",
            "六二：豐其蔀，日中見斗。往得疑疾，有孚發若，吉。",
            "初九：遇其配主，雖旬無咎，往有尚。"
        ]
    },
    "001110": {
        "name": "雷風  恆",
        "yaoCi": [
            "上六：振恆，凶。",
            "六五：恆其德貞，婦人吉，夫子凶。",
            "九四：田無禽。",
            "九三：不恆其德，或承之羞，貞吝。",
            "九二：悔亡。",
            "初六：浚恆，貞凶，無攸利。"
        ]
    },
    "001111": {
        "name": "雷天  大壯",
        "yaoCi": [
            "上六：羝羊觸藩，不能退，不能遂，無攸利，艱則吉。",
            "六五：喪羊於易，無悔。",
            "九四：貞吉悔亡，藩決不羸，壯於大輿之輹。",
            "九三：小人用壯，君子用罔。貞厲，羝羊觸藩，羸其角。",
            "九二：貞吉。",
            "初九：壯於趾，征凶，有孚。"
        ]
    },
    "010000": {
        "name": "水地  比",
        "yaoCi": [
            "上六：比之無首，凶。",
            "九五：顯比，王用三驅，失前禽。邑人不誡，吉。",
            "六四：外比之，貞吉。",
            "六三：比之匪人。",
            "六二：比之自內，貞吉。",
            "初六：有孚比之，無咎。有孚盈缶，終來有他，吉。"
        ]
    },
    "010001": {
        "name": "水雷  屯",
        "yaoCi": [
            "上六：乘馬班如，泣血漣如。",
            "九五：屯其膏，小貞吉，大貞凶。",
            "六四：乘馬班如，求婚媾。往吉，無不利",
            "六三：即鹿無虞，惟入於林中。君子幾，不如舍，往吝。",
            "六二：屯如邅如，乘馬班如。匪寇，婚媾。女子貞不字，十年乃字",
            "初九：磐桓，利居貞，利建侯。"
        ]
    },
    "010010": {
        "name": "水  坎",
        "yaoCi": [
            "上六：係用黴纆，寘於叢棘，三歲不得，凶。",
            "九五：坎不盈，祗既平，無咎。",
            "六四：樽酒，簋貳，用缶，納約自牖，終無咎。",
            "六三：來之坎坎，險且枕，入於坎窞，勿用。",
            "九二：坎，有險，求小得。",
            "初六：習坎，入於坎窞，凶。"
        ]
    },
    "010011": {
        "name": "水澤  節",
        "yaoCi": [
            "上六：苦節貞凶，悔亡。",
            "九五：甘節吉往有尚。",
            "六四：安節亨。",
            "六三：不節若，則嗟若，無咎。",
            "九二：不出門庭，凶。",
            "初九：不出戶庭，無咎。"
        ]
    },
    "010100": {
        "name": "水山  蹇",
        "yaoCi": [
            "上六：往蹇來碩，吉。利見大人。",
            "九五：大蹇朋來。",
            "六四：往蹇來連。",
            "九三：往蹇來反。",
            "六二：王臣蹇蹇，匪躬之故。",
            "初六：往蹇來譽。"
        ]
    },
    "010101": {
        "name": "水火  既濟",
        "yaoCi": [
            "上六：濡其首，厲。",
            "九五：東鄰殺牛，不如西鄰之禴祭，實受其福。",
            "六四：繻有衣袽，終日戒。",
            "九三：高宗伐鬼方，三年克之，小人勿用。",
            "六二：婦喪其茀，勿逐，七日得。",
            "初九：曳其輪，濡其尾，無咎。"
        ]
    },
    "010110": {
        "name": "水風  井",
        "yaoCi": [
            "上六：井收勿幕，有孚元吉。",
            "九五：井洌寒泉食。",
            "六四：井甃無咎。",
            "九三：井渫不食，為我心惻，可用汲王明，並受其福。",
            "九二：井谷射鮒，甕敝漏。",
            "初六：井泥不食，舊井無禽。"
        ]
    },
    "011000": {
        "name": "澤地  萃",
        "yaoCi": [
            "上六：齎咨涕洟，無咎。",
            "九五：萃有位，無咎匪孚，元永貞悔亡。",
            "九四：大吉無咎。",
            "六三：萃如嗟如，無攸利往無咎，小吝。",
            "六二：引吉，無咎，孚乃利用禴。",
            "初六：有孚不終，乃亂乃萃，若號一握為笑，勿恤往無咎。"
        ]
    },
    "011001": {
        "name": "澤雷  隨",
        "yaoCi": [
            "上六：拘繫之，乃從維之。王用亨於西山。",
            "九五：孚於嘉吉。",
            "九四：隨有獲，貞凶。有孚在道，以明何咎。",
            "六三：繫丈夫，失小子。隨有求得，利居貞。",
            "六二：繫小子，失丈夫。",
            "初九：官有渝，貞吉。出門交有功。"
        ]
    },
    "011010": {
        "name": "澤水  困",
        "yaoCi": [
            "上六：困於葛藟，於臲卼，曰動悔有悔，征吉。",
            "九五：劓刖，困於赤紱，乃徐有說。利用祭祀。",
            "九四：來徐徐，困於金車，吝終吉。",
            "六三：困於石，據於蒺藜，入於其宮，不見其妻，凶。",
            "九二：困於酒食，朱紱方來，利用享祀，征凶，無咎。",
            "初六：臀困於株木，入於幽谷，三歲不覿。"
        ]
    },
    "011011": {
        "name": "澤  兌",
        "yaoCi": [
            "上六：引兌。",
            "九五：孚於剝，有厲。",
            "九四：商兌未寧，介疾有喜。",
            "六三：來兌凶。",
            "九二：孚兌吉，悔亡。",
            "初九：和兌吉。"
        ]
    },
    "011100": {
        "name": "澤山  咸",
        "yaoCi": [
            "上六：咸其輔頰舌。",
            "九五：咸其脢，無悔。",
            "九四：貞吉悔亡，憧憧往來，朋從爾思。",
            "九三：咸其股，執其隨，往吝。",
            "六二：咸其腓，凶居，吉。",
            "初六：咸其拇。"
        ]
    },
    "011101": {
        "name": "澤火  革",
        "yaoCi": [
            "上六：君子豹變，小人革面，征凶居貞吉。",
            "九五：大人虎變，未占有孚。",
            "九四：悔亡，有孚改命吉。",
            "九三：征凶貞厲，革言三就乃有孚。",
            "六二：巳日乃革之，征吉無咎。",
            "初九：鞏用黃牛之革。"
        ]
    },
    "011110": {
        "name": "澤風  大過",
        "yaoCi": [
            "上六：過涉滅頂，凶，無咎。",
            "九五：枯楊生華，老婦得其士夫，無咎無譽。",
            "九四：棟隆，吉。有它吝。",
            "九三：棟橈，凶。",
            "九二：枯楊生稊，老夫得其女妻，無不利。",
            "初六：藉用白茅，無咎。"
        ]
    },
    "011111": {
        "name": "澤天  夬",
        "yaoCi": [
            "上六：無號，終有凶。",
            "九五：莧陸夬夬，中行無咎。",
            "九四：臀無膚，其行次且，牽羊悔亡，聞言不信。",
            "九三：壯於頄，有凶。君子夬夬，獨行，遇雨若濡。有慍無咎。",
            "九二：惕號，莫夜有戎，勿恤。",
            "初九：壯於前趾，往不勝為咎。"
        ]
    },
    "100000": {
        "name": "山地  剝",
        "yaoCi": [
            "上九：碩果不食，君子得輿，小人剝廬。",
            "六五：貫魚以宮人寵，無不利。",
            "六四：剝床以膚，凶。",
            "六三：剝之無咎。",
            "六二：剝床以辨，蔑貞凶。",
            "初六：剝床以足，蔑貞凶。"
        ]
    },
    "100001": {
        "name": "山雷 頤",
        "yaoCi": [
            "上九：由頤，厲吉，利涉大川。",
            "六五：拂經，居貞吉，不可涉大川。",
            "六四：顛頤，吉，虎視眈眈，其欲逐逐，無咎。",
            "六三：拂頤，貞凶，十年勿用，無攸利。",
            "六二：顛頤，拂經於丘頤，征凶。",
            "初九：舍爾靈龜，觀我朵頤，凶。"
        ]
    },
    "100010": {
        "name": "山水  蒙",
        "yaoCi": [
            "上九：擊蒙，不利為寇，利禦寇。",
            "六五：童蒙，吉。",
            "六四：困蒙，吝。",
            "六三：勿用取女，見金夫，不有躬，無攸利。",
            "九二：包蒙，吉。納婦，吉。子克家。",
            "初六：發蒙，利用刑人，用說桎梏，以往吝。"
        ]
    },
    "100011": {
        "name": "山澤  損",
        "yaoCi": [
            "上九：弗損益之，無咎貞吉，利有攸往，得臣無家。",
            "六五：或益之十朋之龜，弗克違，元吉。",
            "六四：損其疾，使遄有喜，無咎。",
            "六三：三人行則損一人，一人行則得其友。",
            "九二：利貞，征凶，弗損益之。",
            "初九：已事遄往，無咎，酌損之。"
        ]
    },
    "100100": {
        "name": "山  艮",
        "yaoCi": [
            "上九：敦艮吉。",
            "六五：艮其輔，言有序，悔亡。",
            "六四：艮其身，無咎。",
            "九三：艮其限，列其夤，厲薰心。",
            "六二：艮其腓，不拯其隨，其心不快。",
            "初六：艮其趾，無咎利永貞。"
        ]
    },
    "100101": {
        "name": "山火  賁",
        "yaoCi": [
            "上九：白賁，無咎。",
            "六五，賁於丘園，束帛戔戔。吝，終吉。",
            "六四：賁如皤如，白馬翰如，匪寇婚媾。",
            "九三：賁如濡如，永貞吉。",
            "六二：賁其須。",
            "初九：賁其趾，舍車而徒。"
        ]
    },
    "100110": {
        "name": "山風  蠱",
        "yaoCi": [
            "上九：不事王侯，高尚其事。",
            "六五：幹父之蠱，用譽。",
            "六四：裕父之蠱，往見吝。",
            "九三，幹父之蠱，小有悔，無大咎。",
            "九二：幹母之蠱，不可貞。",
            "初六：幹父之蠱，有子考無咎，厲終吉。"
        ]
    },
    "100111": {
        "name": "山天  大畜",
        "yaoCi": [
            "上九：何天之衢，亨。",
            "六五：豶豕之牙，吉。",
            "六四：童牛之牿，元吉。",
            "九三：良馬逐，利艱貞。日閑輿衛，利有攸往。",
            "九二：輿說輹。",
            "初九：厲吉。"
        ]
    },
    "101000": {
        "name": "火地  晉",
        "yaoCi": [
            "上九：晉其角，維用伐邑，厲吉無咎，貞吝。",
            "六五：悔亡，失得勿恤，往吉無不利。",
            "九四：晉如鼫鼠，貞厲。",
            "六三：眾允，悔亡。",
            "六二：晉如愁如，貞吉。受茲介福，於其王母。",
            "初六：晉如摧如，貞吉。罔孚裕無咎。"
        ]
    },
    "101001": {
        "name": "火雷  噬嗑",
        "yaoCi": [
            "上九：何校滅耳，凶。",
            "六五：噬乾肉，得黃金，貞厲，無咎。",
            "九四，噬乾胏，得金矢，利艱貞吉。",
            "六三：噬腊肉，遇毒，小吝，無咎。",
            "六二：噬膚滅鼻，無咎。",
            "初九：屨校滅趾，無咎。"
        ]
    },
    "101010": {
        "name": "火水  未濟",
        "yaoCi": [
            "上九：有孚於飲酒，無咎。濡其首，有孚，失是。",
            "六五：貞吉無悔，君子之光，有孚吉。",
            "九四：貞吉悔亡，震用伐鬼方，三年有賞於大國。",
            "六三：未濟征凶，利涉大川。",
            "九二：曳其輪，貞吉。",
            "初六：濡其尾，吝。"
        ]
    },
    "101011": {
        "name": "火澤  睽",
        "yaoCi": [
            "上九：睽孤，見豕負塗，載鬼一車，先張之弧，後說之弧，匪寇婚媾。往，遇雨則吉。",
            "六五：悔亡。厥宗噬膚，往何咎。",
            "九四：睽孤，遇元夫，交孚厲無咎。",
            "六三：見輿曳，其牛掣，其人天且劓，無初有終。",
            "九二：遇主於巷，無咎。",
            "初九：悔亡，喪馬勿逐，自復。見惡人，無咎。"
        ]
    },
    "101100": {
        "name": "火山  旅",
        "yaoCi": [
            "上九：鳥焚其巢，旅人先笑後號咷。喪牛於易，凶。",
            "六五：射雉一矢亡，終以譽命。",
            "九四：旅於處，得其資斧，我心不快。",
            "九三：旅焚其次，喪其童僕貞厲。",
            "六二：旅即次，懷其資，得童僕貞。",
            "初六：旅瑣瑣，斯其所取災。"
        ]
    },
    "101101": {
        "name": "火  離",
        "yaoCi": [
            "上九：王用出征，有嘉折首，獲匪其醜，無咎。",
            "六五：出涕沱若，戚嗟若，吉。",
            "九四：突如其來如，焚如，死如，棄如。",
            "九三：日昃之離，不鼓缶而歌，則大耋之嗟，凶。",
            "六二：黃離，元吉。",
            "初九：履錯然，敬之，無咎。"
        ]
    },
    "101110": {
        "name": "火風  鼎",
        "yaoCi": [
            "上九：鼎玉鉉，大吉，無不利。",
            "六五：鼎黃耳金鉉，利貞。",
            "九四：鼎折足，覆公餗，其形渥，凶。",
            "九三：鼎耳革，其行塞，雉膏不食，方雨虧悔，終吉。",
            "九二：鼎有實，我仇有疾，不我能即，吉。",
            "初六：鼎顛趾，利出否，得妾以其子，無咎。"
        ]
    },
    "101111": {
        "name": "火天  大有",
        "yaoCi": [
            "上九：自天祐之，吉無不利。",
            "六五：厥孚交如，威如，吉。",
            "九四：匪其彭，無咎。",
            "九三：公用亨於天子，小人弗克。",
            "九二：大車以載，有攸往，無咎。",
            "初九：無交害，匪咎，艱則無咎。"
        ]
    },
    "110000": {
        "name": "風地  觀",
        "yaoCi": [
            "上九：觀其生，君子無咎。",
            "九五：觀我生，君子無咎。",
            "六四：觀國之光，利用賓於王。",
            "六三：觀我生，進退。",
            "六二：窺觀，利女貞。",
            "初六：童觀，小人無咎，君子吝。"
        ]
    },
    "110001": {
        "name": "風雷  益",
        "yaoCi": [
            "上九：莫益之，或擊之，立心勿恆，凶。",
            "九五：有孚惠心，勿問元吉，有孚惠我德。",
            "六四：中行告公從，利用為依遷國。",
            "六三：益之用凶事，無咎有孚，中行告公用圭。",
            "六二：或益之十朋之龜，弗克違，永貞吉。王用亨於帝吉。",
            "初九：利用為大作，元吉無咎。"
        ]
    },
    "110010": {
        "name": "風水  渙",
        "yaoCi": [
            "上九：渙其血去逖出。",
            "九五：渙汗其大號，渙王居無咎。",
            "六四：，渙其群，元吉。渙有丘，匪夷所思。",
            "六三：渙其躬，無悔。",
            "九二：渙奔其机，悔亡。",
            "初六：用拯馬壯吉。"
        ]
    },
    "110011": {
        "name": "風澤  中孚",
        "yaoCi": [
            "上九：翰音登於天，貞凶。",
            "九五：有孚攣如，無咎。",
            "六四：月幾望，馬匹亡，無咎。",
            "六三：得敵或鼓或罷或泣或歌。",
            "九二：鳴鶴在陰，其子和之，我有好爵，吾與爾靡之。",
            "初九：虞吉，有它不燕。"
        ]
    },
    "110100": {
        "name": "風山  漸",
        "yaoCi": [
            "上九：鴻漸於逵，其羽可用為儀吉。",
            "九五：鴻漸於陵，婦三歲不孕，終莫之勝吉。",
            "六四：鴻漸於木，或得其桷，無咎。",
            "九三：鴻漸於陸，夫征不復，婦孕不育，凶利禦寇。",
            "六二：鴻漸於磐，飲食衎衎，吉。",
            "初六：鴻漸於干，小子厲有言，無咎。"
        ]
    },
    "110101": {
        "name": "風火  家人",
        "yaoCi": [
            "上九：有孚威如，終吉。",
            "九五：王假有家，勿恤吉。",
            "六四：富家大吉。",
            "九三：家人嗃嗃，悔厲吉，婦子嘻嘻，終吝。",
            "六二：無攸遂，在中饋，貞吉。",
            "初九：閑有家，悔亡。"
        ]
    },
    "110110": {
        "name": "風  巽",
        "yaoCi": [
            "上九：巽在床下，喪其資斧，貞凶。",
            "九五：貞吉悔亡無不利，無初有終，先庚三日後庚三日吉。",
            "六四：悔亡，田獲三品。",
            "九三：頻巽吝。",
            "九二：巽在床下，用史巫紛若吉無咎。",
            "初六：進退，利武人之貞。"
        ]
    },
    "110111": {
        "name": "風天  小畜",
        "yaoCi": [
            "上九：既雨既處，尚德載。婦貞厲，月幾望，君子征凶。",
            "九五：有孚攣如，富以其鄰。",
            "六四：有孚，血去惕出，無咎。",
            "九三：輿說輻，夫妻反目。",
            "九二：牽復，吉。",
            "初九：復自道，何其咎，吉。"
        ]
    },
    "111000": {
        "name": "天地  否",
        "yaoCi": [
            "上九：傾否，先否後喜。",
            "九五：休否，大人吉。其亡其亡，繫於苞桑。",
            "九四：有命無咎，疇離祉。",
            "六三：包羞。",
            "六二：包承，小人吉，大人否亨。",
            "初六：拔茅茹，以其彙。貞吉，亨。"
        ]
    },
    "111001": {
        "name": "天雷  無妄",
        "yaoCi": [
            "上九：無妄行，有眚，無攸利。",
            "九五：無妄之疾，勿藥有喜。",
            "九四：可貞無咎。",
            "六三：無妄之災，或繫之牛，行人得之，邑人之災。",
            "六二：不耕穫，不菑畬，則利有攸往。",
            "初九：無妄往吉。"
        ]
    },
    "111010": {
        "name": "天水  訟",
        "yaoCi": [
            "上九：或錫之鞶帶，終朝三褫之。",
            "九五：訟，元吉。",
            "九四：不克訟，復即命，渝安貞，吉。",
            "六三：食舊德，貞厲，終吉。或從王事，無成。",
            "九二：不克訟，歸而逋，其邑人三百戶，無眚。",
            "初六：不永所事，小有言，終吉。"
        ]
    },
    "111011": {
        "name": "天澤  履",
        "yaoCi": [
            "上九：視履考祥，其旋元吉。",
            "九五：夬履，貞厲。",
            "九四：履虎尾，愬愬，終吉。",
            "六三：眇能視，跛能履。履虎尾，咥人，凶。武人為於大君。",
            "九二：履道坦坦，幽人貞吉。",
            "初九：素履，往無咎。"
        ]
    },
    "111100": {
        "name": "天山  遯",
        "yaoCi": [
            "上九：肥遯無不利。",
            "九五：嘉遯貞吉。",
            "九四：好遯君子吉，小人否。",
            "九三：係遯，有疾厲，畜臣妾吉。",
            "六二：執之用黃牛之革，莫之勝說。",
            "初六：遯尾厲，勿用有攸往。"
        ]
    },
    "111101": {
        "name": "天火  同人",
        "yaoCi": [
            "上九：同人於郊，無悔。",
            "九五：同人先號咷而後笑，大師克相遇。",
            "九四：乘其墉，弗克攻，吉。",
            "九三：伏戎於莽，升其高陵，三歲不興。",
            "六二：同人於宗，吝。",
            "初九：同人於門，無咎。"
        ]
    },
    "111110": {
        "name": "天風  姤",
        "yaoCi": [
            "上九：姤其角，吝無咎。",
            "九五：以杞包瓜，含章有隕自天。",
            "九四：包無魚，凶。",
            "九三：臀無膚，其行次且，厲無大咎。",
            "九二：包有魚，無咎，不利賓。",
            "初六：繫於金柅，貞吉。有攸往，見凶。羸豕孚蹢躅。"
        ]
    },
    "111111": {
        "name": "天  乾",
        "yaoCi": [
            "上九：亢龍有悔。",
            "九五：飛龍在天，利見大人。",
            "九四：或躍在淵，無咎。",
            "九三：君子終日乾乾，夕惕若，厲，無咎。",
            "九二：見龍在田，利見大人。",
            "初九：潛龍，勿用。"
        ]
    }
};